"""
Параметры для HR бота
"""

HR_BOT_TOKEN =  {'name': '@Yugu_HR_bot',
                           'URL': 'https://t.me/Yugu_HR_bot',
                           'token': '6096922509:AAEVP8m7xiSLll0nZH7Z257siv4wasPxGEw'}

# Словарь сообщений которые выдает бот в соответствии ключами.
# Ключи: 0 - сообщения приветствия, 1 - сообщнеия 1-го дня, 2 - сообщения 2-го дня
BOT_MESSSAGE = {
    0: ["Доброе утро! Я Вас приветствую в Банке России",
        "Пожалуйста, укажите, как к Вам можно обращаться:"
        ],
    1: ['C началом трудовой деятельности в Банке Росси',
        'Вы готовы приступить к работе по адаптации?',
        'сегодня в рамках программы адаптации'
        '\nВам необходимо пройти вводный курс'
        '\n"Добро пожаловать в Банк России"'
        '\nна корпоративном порте Банка России в разделе «Дистанционное обучение»',
        'После того, как Вы пройдете этот курс, нажми клавишу "Прошел" и получите новое задание',
        'Отлично! Вы готовы продолжать?',
        'Вам необходимо пройти дистанционный курс «Основы антикоррупции»'
        '\nна корпоративном порте Банка России в разделе «Дистанционное обучение»'
        ],
    2: []
                }
